In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [83]:
s = pd.Series([1,2,3,np.nan,68])
s

0     1.0
1     2.0
2     3.0
3     NaN
4    68.0
dtype: float64

In [11]:
dates = pd.date_range('20181102', periods=6)

In [16]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, col
                  umns=list('ABCD'))
df

                   A         B         C         D
2018-11-02  1.925260 -0.317066 -0.050977 -1.029758
2018-11-03 -1.061780 -0.060344  0.656254  2.000556
2018-11-04 -0.875698 -0.613194 -0.266876 -2.538942
2018-11-05 -0.721643 -1.193306 -0.905922  0.043761
2018-11-06 -0.254558  1.318703 -1.014877 -0.437678
2018-11-07  0.349765  0.371688  1.725759  0.364095

In [43]:
df2 = pd.DataFrame({ 'A': 1.,
                     'B': pd.Timestamp('20181102'),
                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                     'D': np.array([3] * 4, 'int32'),
                     'E': pd.Categorical(['test','train','test','train']),
                     'T': 'foo',
                   })
df2

     A          B    C  D      E    T
0  1.0 2018-11-02  1.0  3   test  foo
1  1.0 2018-11-02  1.0  3  train  foo
2  1.0 2018-11-02  1.0  3   test  foo
3  1.0 2018-11-02  1.0  3  train  foo

In [34]:
df

                   A         B         C         D
2018-11-02  1.925260 -0.317066 -0.050977 -1.029758
2018-11-03 -1.061780 -0.060344  0.656254  2.000556
2018-11-04 -0.875698 -0.613194 -0.266876 -2.538942
2018-11-05 -0.721643 -1.193306 -0.905922  0.043761
2018-11-06 -0.254558  1.318703 -1.014877 -0.437678
2018-11-07  0.349765  0.371688  1.725759  0.364095

In [59]:
print(df2.sort_index(0, ascending=False))
print(df2.sort_index(1, ascending=False))

     A          B    C  D      E    T
3  1.0 2018-11-02  1.0  3  train  foo
2  1.0 2018-11-02  1.0  3   test  foo
1  1.0 2018-11-02  1.0  3  train  foo
0  1.0 2018-11-02  1.0  3   test  foo
     T      E  D    C          B    A
0  foo   test  3  1.0 2018-11-02  1.0
1  foo  train  3  1.0 2018-11-02  1.0
2  foo   test  3  1.0 2018-11-02  1.0
3  foo  train  3  1.0 2018-11-02  1.0

In [79]:
df3 =  pd.DataFrame(np.random.randint(0,1000,(6,4)), index=dates, columns=list('ABCD'))

In [82]:
print(df3)
print(df3.sort_values(by='B', axis=0))
print(df3.sort_values(by='20181102', axis=1))

              A    B    C    D
2018-11-02   50  870  430    5
2018-11-03  244  844  436  229
2018-11-04  828   55  242  608
2018-11-05  992  440   60  226
2018-11-06  700   76  274  257
2018-11-07  419  143  376  596
              A    B    C    D
2018-11-04  828   55  242  608
2018-11-06  700   76  274  257
2018-11-07  419  143  376  596
2018-11-05  992  440   60  226
2018-11-03  244  844  436  229
2018-11-02   50  870  430    5
              D    A    C    B
2018-11-02    5   50  430  870
2018-11-03  229  244  436  844
2018-11-04  608  828  242   55
2018-11-05  226  992   60  440
2018-11-06  257  700  274   76
2018-11-07  596  419  376  143

# Selection

In [87]:
df3[0:]

              A    B    C    D
2018-11-02   50  870  430    5
2018-11-03  244  844  436  229
2018-11-04  828   55  242  608
2018-11-05  992  440   60  226
2018-11-06  700   76  274  257
2018-11-07  419  143  376  596

In [89]:
df3['20181104':'20181106']

              A    B    C    D
2018-11-04  828   55  242  608
2018-11-05  992  440   60  226
2018-11-06  700   76  274  257

In [91]:
df3.loc['20181104']

A    828
B     55
C    242
D    608
Name: 2018-11-04 00:00:00, dtype: int32

In [96]:
df3.loc['20181105':'20181107','C':'D']

              C    D
2018-11-05   60  226
2018-11-06  274  257
2018-11-07  376  596

In [107]:
df3.at[dates[3],'D']

226

In [110]:
df3[['A']]

              A
2018-11-02   50
2018-11-03  244
2018-11-04  828
2018-11-05  992
2018-11-06  700
2018-11-07  419